[
    {
        "id": "0",
        "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "SM Lee Hsien Loong at the Teck Ghee Citizenship Ceremony (Mar 2025)",
                "url": "https://www.pmo.gov.sg/Newsroom/SM-Lee-Hsien-Loong-at-the-Teck-Ghee-Citizenship-Ceremony-Mar-2025",
                "content": "Whatever your story, we are happy that you have decided to make Singapore your home, and we look forward to your contributions as citizens. It also makes sense for Singapore to welcome new citizens like you. It is also about new citizens bringing with you something extra that is vital – enriching our society and invigorating our economy in ways beyond what numbers can show. To be big-hearted, and welcome new citizens as valuable members of our Singapore team. Singapore’s success has always been built on our people: those who came earlier from distant lands; their children born here; and those who continue to join us every year from all over the world to make this their home, to become Singaporeans.",
                "score": 0.8865877,
                "raw_content": null
            },
            {
                "title": "New citizens enrich Singapore, invigorate economy 'in ways beyond ... - CNA",
                "url": "https://www.channelnewsasia.com/singapore/sm-lee-hsien-loong-new-citizens-enrich-invigorate-economy-integration-harmony-4988206",
                "content": "New citizens enrich Singapore, invigorate economy 'in ways beyond what numbers can show': SM Lee - CNA New citizens enrich Singapore, invigorate economy 'in ways beyond what numbers can show': SM Lee WhatsApp Telegram Facebook Twitter Email LinkedIn WhatsApp Telegram Facebook Twitter Email LinkedIn SINGAPORE: New citizens enrich Singapore and invigorate its economy “in ways beyond what numbers can show”, said Senior Minister Lee Hsien Loong on Sunday (Mar 9). The Singapore government is “keenly aware” of the need to handle immigration and integration sensitively, especially as the inflows are not small either, said Mr Lee. Every year, there are about 30,000 citizen babies born and Singapore takes in about 22,000 new citizens.",
                "score": 0.72675586,
                "raw_content": null
            },
            {
                "title": "Immigration is essential and existential for Singapore's survival: SM Lee",
                "url": "https://www.straitstimes.com/singapore/immigration-is-essential-and-existential-for-singapores-survival-sm-lee",
                "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9. Singapore needs new citizens to top up its numbers and to keep its economy growing, though immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, he said. Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, SM Lee said. The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
                "score": 0.72489023,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.0,
            "explanation": "The given text accurately reflects Mr. Lee Hsien Loong's statements about new citizens enriching Singapore’s society and economy, as corroborated by multiple reliable sources including direct quotes and context from the articles listed. There are no discrepancies or false claims in the information presented."
        }
    },
    {
        "id": "1",
        "content": "“New arrivals bring fresh experiences, diverse perspectives and global connections. You help us to plug into the world, and thrive as a regional hub and a global node,” said SM Lee.",
        "to_fact_check": false
    },
    {
        "id": "2",
        "content": "This was how cities like London, New York and Shanghai became great centres of culture and prosperity – by attracting talent from all over the world and creating an environment of constant innovation and enterprise, he added.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "China's Key Cities: From Local Places to Global Players",
                "url": "https://worldfinancialreview.com/chinas-key-cities-from-local-places-to-global-players/",
                "content": "This trend not only puts Shanghai's economic transition ahead of all other manufacturing-oriented cities in China but also places Shanghai on a similar pathway like other global cities as important service hubs. Shanghai is indeed on track to resemble the economic profile of global cities like New York and London (see Figure 2).",
                "score": 0.38776046,
                "raw_content": null
            },
            {
                "title": "The Function of Shanghai as a Global Central City: A comparison with London",
                "url": "https://www.researchgate.net/publication/362653018_The_Function_of_Shanghai_as_a_Global_Central_City_A_comparison_with_London",
                "content": "global cities: An Empirical Analysis of New York, London, Tok yo and Shanghai, China modern city research center of East China Normal University, Shanghai urban development studies Vol.21 No.4 2014.",
                "score": 0.28402013,
                "raw_content": null
            },
            {
                "title": "Immigration is essential and existential for Singapore's survival: SM ...",
                "url": "https://www.straitstimes.com/singapore/immigration-is-essential-and-existential-for-singapores-survival-sm-lee",
                "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9. Singapore needs new citizens to top up its numbers and to keep its economy growing, though immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, he said. Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, SM Lee said. The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
                "score": 0.010769465,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.2,
            "explanation": "The given text is mostly accurate as it describes how cities like London, New York, and Shanghai have thrived through attracting talent and innovation. However, it slightly oversimplifies the complex factors contributing to their success. While talent attraction is crucial, it overlooks other elements such as historical context, policy frameworks, and economic conditions. Therefore, while not fully misinformation, it lacks nuance, leading to a score of 0.2."
        }
    },
    {
        "id": "3",
        "content": "This dynamism spurs growth and reinforces the success of these cities, and attracts even more talent, said SM Lee, who was speaking at the Teck Ghee Citizenship Ceremony held at Nanyang Polytechnic.",
        "to_fact_check": false
    },
    {
        "id": "4",
        "content": "“Singapore, too, must always be open to ideas and talent from around the world,” he told about 200 new citizens. “This is how we became a shining red dot.”",
        "to_fact_check": false
    },
    {
        "id": "5",
        "content": "He pointed out that immigration is essential – even existential – for Singapore’s survival.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "Immigration is essential and existential for Singapore's survival: SM ...",
                "url": "https://www.straitstimes.com/singapore/immigration-is-essential-and-existential-for-singapores-survival-sm-lee",
                "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9. Singapore needs new citizens to top up its numbers and to keep its economy growing, though immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, he said. Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, SM Lee said. The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
                "score": 0.74385756,
                "raw_content": null
            },
            {
                "title": "SM Lee on why immigration is essential to Singapore's survival",
                "url": "https://vulcanpost.com/882761/sm-lee-hsien-loong-immigration-singapore-teck-ghee-citizenship/",
                "content": "Published Time: 2025-03-10T14:42:15+0800 SM Lee on why immigration is essential to Singapore's survival “It makes sense”: Why SM Lee Hsien Loong supports immigration into Singapore While SM Lee emphasised the importance of sharing the same sentiment in Singapore, he also acknowledged the competition that comes with immigration and said that it’s a “sensitive issue in every country.” As Singapore grapples with a declining birth rate and an aging population, SM Lee called for a need to “top up the numbers” for the economy to grow. Previously, it was reported that Singapore will potentially see more deaths than births by the 2030s, to which the government has ramped up the increased immigration of foreign workers. Only time will tell. Subscribe to our newsletter Subscribe Facebook Instagram Youtube Twitter Facebook Instagram Youtube Twitter Tiktok Instagram Facebook",
                "score": 0.71425,
                "raw_content": null
            },
            {
                "title": "Immigration essential, even existential, for S'pore's survival as new ...",
                "url": "https://mothership.sg/2025/03/immigration-essential-even-existential-for-spores-survival-as-new-citizens-enrich-invigorate-spore-sm-lee/",
                "content": "Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee - Mothership.SG - News from Singapore, Asia and around the world Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee SM Lee further said that Singapore needed new citizen to \"top up our numbers\" and to keep the economy growing, noting that the \"resident workforce\" is already at \"full employment, and ageing\". However, SM Lee said it was not just about numbers, but for new citizens to enrich Singapore's society and invigorate the economy in ways \"beyond what numbers can show\". Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee",
                "score": 0.67501575,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.1,
            "explanation": "The given text accurately reflects the sentiments expressed by SM Lee regarding immigration's vital role in Singapore's survival. However, it simplifies the context by omitting the acknowledgment of competition and pressures faced by current citizens, which is mentioned in the sources. Thus, it is not entirely misleading but fails to capture the complete nuance of the discussion."
        }
    },
    {
        "id": "6",
        "content": "While larger nations may have the population, resources and hinterland to fall back on, Singapore does not. Singaporeans are not having enough children of their own, and the resident workforce is already at full employment, and ageing, he said.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "Singapore Population 1950-2025 - Macrotrends",
                "url": "https://www.macrotrends.net/global-metrics/countries/SGP/singapore/population",
                "content": "Singapore Population 1950-2025 | MacroTrends Singapore Population 1950-2025 Population Population Chart and table of Singapore population from 1950 to 2025. The population of Singapore in 2024 was 6,052,709, a 0.63% increase from 2023. The population of Singapore in 2023 was 6,014,723, a 0.65% increase from 2022. The population of Singapore in 2022 was 5,975,689, a 0.58% increase from 2021. Data Source: United Nations - World Population Prospects  | Country Name | 2025 Population | | Singapore - Historical Population Data | | Year | Population | Growth Rate | If you use our chart images on your site or blog, we ask that you provide attribution via a link back to this page. | Singapore Population 1950-2025 |  | | Singapore Population 1950-2025 |  |",
                "score": 0.69622743,
                "raw_content": null
            },
            {
                "title": "Singapore: total population 1980-2029 - Statista",
                "url": "https://www.statista.com/statistics/378558/total-population-of-singapore/",
                "content": "In 2023, the total population of Singapore is estimated to be approximately 5.92 million peopl. Population growth in the country is slow and numbers have still not recovered to pre-pandemic levels",
                "score": 0.30380458,
                "raw_content": null
            },
            {
                "title": "Citizen Population Scenarios",
                "url": "https://www.population.gov.sg/media-centre/press-releases/citizen-population-scenarios/",
                "content": "4 Source: Singapore: Singapore Department of Statistics (DOS), others: World Health Organisation, 2009 5 29% of the citizen population as of June 2011 6 The old-age support ratio is generally computed as the ratio of persons aged 15-64 years to persons aged 65 years and over, following international practice and United Nations' recommendations.",
                "score": 0.17150508,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.4,
            "explanation": "The statement about Singaporeans not having enough children aligns with data suggesting low birth rates, but it lacks specific statistics from the provided sources. The mention of the resident workforce being at full employment is vague and could mislead without proper context. Overall, while there is a kernel of truth, the assertion could be seen as an oversimplification or lacking direct backing from the sources."
        }
    },
    {
        "id": "7",
        "content": "Singapore needs new citizens to top up its numbers and to keep its economy growing, he said.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "Singapore Population Growth Rate 1950-2025 - Macrotrends",
                "url": "https://www.macrotrends.net/global-metrics/countries/SGP/singapore/population-growth-rate",
                "content": "Singapore Population Growth Rate 1950-2025 | MacroTrends Singapore Population Growth Rate 1950-2025 The population of Singapore in 2024 was 6,052,709, a 0.63% increase from 2023. The population of Singapore in 2023 was 6,014,723, a 0.65% increase from 2022. Data Source: United Nations - World Population Prospects  | Similar Countries Ranked by Population Growth Rate | | Country Name | 2025 Population Growth Rate | | Singapore - Historical Population Growth Rate Data | | Year | Population Growth Rate | Growth Rate | If you use our chart images on your site or blog, we ask that you provide attribution via a link back to this page. | Singapore Population Growth Rate 1950-2025 |  | | Singapore Population Growth Rate 1950-2025 |  |",
                "score": 0.95618236,
                "raw_content": null
            },
            {
                "title": "Singapore Population (2025)",
                "url": "https://populationtoday.com/sg-singapore/",
                "content": "Singapore Population (2025) Population TODAY Population of Singapore today Population of Singapore as of today The current population of Singapore is 5,853,862 with an annual growth rate of 0.628%. Singapore has a population of 0.071% of the world's population. Population5,853,862Growth Rate0.628%Male3,023,562 (51.651%)Female2,830,300 (48.349%)Today Change+ 38 Population chart for Singapore Total Population Population History of Singapore | Year | Population (%) | Total Population The population of countries near Singapore | Rank | Iso | Country | Population | Equivalent Singapore | Data sources: United Nations,World Bank, Nations Geo ,Census,Wikidata Population data is included in world statistical data, which can provide insight into the population size, population growth rate, and population density of a given country or region Contact & privacy",
                "score": 0.95282507,
                "raw_content": null
            },
            {
                "title": "Singapore Population (2025) - Worldometer",
                "url": "https://www.worldometers.info/world-population/singapore-population/",
                "content": "Population Singapore Population (LIVE) Singapore Population (1950 - 2025) Singapore 2025 population is estimated at 5,870,750 people at mid year. Singapore population is equivalent to 0.07% of the total world population. Population of Singapore (2025 and historical) World Pop   World Population    Singapore Singapore Population Forecast World Pop   World Population    Singapore Main Cities by Population in Singapore 19  Serangoon New Town  116,900 The Population of Singapore (1950 - 2024) chart plots the total population count as of July 1 of each year, from 1950 to 2024. Population: Overall total population (both sexes and all ages) in the country as of July 1 of the year indicated, as estimated by the United Nations, Department of Economic and Social Affairs, Population Division.",
                "score": 0.92995757,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.3,
            "explanation": "The statement about Singapore needing new citizens to maintain its population and economic growth aligns with common demographic challenges faced by many developed nations, including Singapore. While the exact need for new citizens can vary and should be supported by relevant data, general discussions on immigration and economic growth are often valid. However, without specific data to back the claim, it introduces a moderate risk of misinformation."
        }
    },
    {
        "id": "8",
        "content": "Immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, but this will create a more vibrant economy and generate better opportunities and brighter prospects for future generations, he added.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "Immigration is essential and existential for Singapore's survival: SM ...",
                "url": "https://www.straitstimes.com/singapore/immigration-is-essential-and-existential-for-singapores-survival-sm-lee",
                "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9. Singapore needs new citizens to top up its numbers and to keep its economy growing, though immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, he said. Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, SM Lee said. The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
                "score": 0.5826579,
                "raw_content": null
            },
            {
                "title": "Immigration key to growth, survival: SM Lee | Singapore Business Review",
                "url": "https://sbr.com.sg/economy/news/immigration-key-growth-survival-sm-lee",
                "content": "Senior Minister Lee Hsien Loong has emphasised the crucial role of immigration in ensuring Singapore's growth and survival. \"We need new citizens to top up our numbers and to keep our economy growing,\" Loong said during the Teck Ghee Citizenship Ceremony at Nanyang Polytechnic Auditorium on 9 March.",
                "score": 0.5363378,
                "raw_content": null
            },
            {
                "title": "New citizens enrich Singapore, invigorate economy 'in ways beyond ... - CNA",
                "url": "https://www.channelnewsasia.com/singapore/sm-lee-hsien-loong-new-citizens-enrich-invigorate-economy-integration-harmony-4988206",
                "content": "New citizens enrich Singapore, invigorate economy 'in ways beyond what numbers can show': SM Lee - CNA New citizens enrich Singapore, invigorate economy 'in ways beyond what numbers can show': SM Lee WhatsApp Telegram Facebook Twitter Email LinkedIn WhatsApp Telegram Facebook Twitter Email LinkedIn SINGAPORE: New citizens enrich Singapore and invigorate its economy “in ways beyond what numbers can show”, said Senior Minister Lee Hsien Loong on Sunday (Mar 9). The Singapore government is “keenly aware” of the need to handle immigration and integration sensitively, especially as the inflows are not small either, said Mr Lee. Every year, there are about 30,000 citizen babies born and Singapore takes in about 22,000 new citizens.",
                "score": 0.48484412,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.1,
            "explanation": "The statement reflects accurate sentiments expressed by Senior Minister Lee Hsien Loong regarding immigration's competitive impacts and the benefits it can bring. While the assertion about competition and pressure is a valid concern, it's also framed positively concerning economic vibrancy and future opportunities. However, the language suggests a slightly optimistic interpretation of the consequences, which may downplay potential negative impacts, hence a minor score of misinformation."
        }
    },
    {
        "id": "9",
        "content": "“If Singapore closes ourselves up, opportunities will pass us by. We will fall behind, and become just like any other city in the region, and our descendants will be the worse off for it,” said SM Lee.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "SM Lee: Immigration is crucial for Singapore's survival and future",
                "url": "https://theindependent.sg/sm-lee-immigration-is-crucial-for-singapores-survival-and-future/",
                "content": "SINGAPORE – On Mar 9, Senior Minister Lee Hsien Loong emphasized the vital role new citizens play in Singapore’s society and economy. While immigration offers clear economic benefits, SM Lee recognized the sensitive nature of integrating new citizens into Singapore’s social fabric. SM Lee noted that every new citizen undergoes the Singapore Citizenship Journey, which educates them on the nation’s values and cultural norms. He urged new citizens to engage actively with Singapore’s society and contribute to its continued success. These stories illustrate how new citizens not only benefit from Singapore’s opportunities but also actively contribute to its community, economy, and cultural life, reinforcing the importance of immigration in the nation’s continued prosperity.",
                "score": 0.56920683,
                "raw_content": null
            },
            {
                "title": "Immigration essential, even existential, for S'pore's survival as new ...",
                "url": "https://mothership.sg/2025/03/immigration-essential-even-existential-for-spores-survival-as-new-citizens-enrich-invigorate-spore-sm-lee/",
                "content": "Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee - Mothership.SG - News from Singapore, Asia and around the world Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee SM Lee further said that Singapore needed new citizen to \"top up our numbers\" and to keep the economy growing, noting that the \"resident workforce\" is already at \"full employment, and ageing\". However, SM Lee said it was not just about numbers, but for new citizens to enrich Singapore's society and invigorate the economy in ways \"beyond what numbers can show\". Immigration essential, even existential, for S'pore's survival as new citizens enrich & invigorate S'pore: SM Lee",
                "score": 0.4292146,
                "raw_content": null
            },
            {
                "title": "Immigration is essential and existential for Singapore's survival: SM Lee",
                "url": "https://www.straitstimes.com/singapore/immigration-is-essential-and-existential-for-singapores-survival-sm-lee",
                "content": "SINGAPORE – New citizens bring with them something extra that is vital to Singapore, enriching its society and invigorating its economy, said Senior Minister Lee Hsien Loong on March 9. Singapore needs new citizens to top up its numbers and to keep its economy growing, though immigration will bring more competition and put pressure on Singaporeans to work harder and meet higher standards, he said. Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, SM Lee said. The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
                "score": 0.42119524,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.1,
            "explanation": "The given text reflects senior minister SM Lee's views on the importance of immigration for Singapore's future, aligning closely with the general sentiment expressed in the provided sources. However, the phrase 'close ourselves up' is somewhat ambiguous and could be interpreted as overly alarmist, yet it does not fundamentally misrepresent his stance. Thus, the score indicates minimal potential misinformation."
        }
    },
    {
        "id": "10",
        "content": "Every year, the Republic has about 30,000 citizen babies born and takes in about 22,000 new citizens.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "Countries with birthright citizenship 2025",
                "url": "https://citizenx.com/insights/birthright-citizenship-countries/",
                "content": "As immigration patterns continue to evolve and global mobility increases, the debate over birthright citizenship remains central to discussions about national identity, immigration policy, and constitutional rights in the United States and beyond. In North America, the United States, Canada, and Mexico all practice jus soli (birthright citizenship), though each country has developed distinct approaches to implementing this principle. While the United States debated restricting birthright citizenship, other nations in the Americas maintained or strengthened their jus soli policies. The United States, Canada, and Mexico are developing coordinated approaches to address shared challenges, while South American nations continue to maintain strong birthright citizenship traditions through regional agreements.",
                "score": 0.468621,
                "raw_content": null
            },
            {
                "title": "Visa Status for Children Born After Birthright Citizenship Ends",
                "url": "https://www.visaverge.com/news/visa-status-for-children-born-after-birthright-citizenship-ends/",
                "content": "Ending birthright citizenship in the U.S., effective February 19, 2025, means children born to non-citizen parents won't gain automatic citizenship. Instead, they'll inherit their parents' visa status or risk statelessness if undocumented. Families must secure dependent visas or explore legal pathways like naturalization or employment-based visas later. The policy faces legal challenges",
                "score": 0.45798564,
                "raw_content": null
            },
            {
                "title": "Foreign-Born Number and Share of U.S. Population at All-Time Highs in ...",
                "url": "https://cis.org/Report/ForeignBorn-Number-and-Share-US-Population-AllTime-Highs-January-2025",
                "content": "T he government's January 2025 Current Population Survey (CPS) shows the foreign-born or immigrant population (legal and illegal together) hit 53.3 million and 15.8 percent of the total U.S. population in January 2025 — both new record highs. The January CPS is the first government survey to be adjusted to better reflect the recent surge in illegal immigrants.",
                "score": 0.45304462,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.9,
            "explanation": "The statement about '30,000 citizen babies' and '22,000 new citizens' lacks context and specific references to support its accuracy. The linked sources discuss U.S. birthright citizenship, immigration patterns, and population statistics but do not provide numbers about new citizens or births. This lack of corroboration and questionable specificity indicates a high potential for misinformation."
        }
    },
    {
        "id": "11",
        "content": "Given that the inflows are not small, the Government is keenly aware of the need to handle immigration and integration sensitively, said SM Lee.",
        "to_fact_check": false
    },
    {
        "id": "12",
        "content": "He noted that immigration is a sensitive issue in every country, and there is always some tension between newcomers and those who are already here.",
        "to_fact_check": false
    },
    {
        "id": "13",
        "content": "Governments play a big part in managing these tensions to make immigration a net plus for societies, SM Lee said.",
        "to_fact_check": false
    },
    {
        "id": "14",
        "content": "Unfortunately, this does not always happen, he noted.",
        "to_fact_check": false
    },
    {
        "id": "15",
        "content": "In many European countries, the immigration inflows have triggered a strong nativist pushback. And when immigrants commit violent crimes, that further turns the mood against them, and deepens divisions in society.",
        "to_fact_check": true,
        "search_results": [
            {
                "title": "The impact of immigration on EU countries' nationalistic sentiments",
                "url": "https://insights.ieseg.fr/en/resource-center/the-impact-of-immigration-on-eu-countries-nationalistic-sentiments/",
                "content": "One possibility is that immigration itself may have led to a rise in anti-immigrant sentiments. Native-born residents of Europe can perceive immigrants as direct competitors in the labour market as well as a drag on the welfare system (for example, pensions) and on public resources such as schools and hospitals. Rightly or wrongly, some natives",
                "score": 0.51413256,
                "raw_content": null
            },
            {
                "title": "What is Driving the Rise of Anti-Immigration Sentiment in Europe?",
                "url": "https://bpr.studentorg.berkeley.edu/2022/12/09/what-is-driving-the-rise-of-anti-immigration-sentiment-in-europe/",
                "content": "But while the perceived financial and economic threats of immigrants are significant, the main driver of the anti-immigration movement in Europe is the symbolic threat that immigrants present to the national culture and values. These are the rules that they still enforce in a majority Muslim country such as Turkey.” While acknowledging that Turkish people choose to go to French schools, Muslim immigrants and French citizens do not have that luxury: “If you choose to wear a hijab over your education, then you don’t receive an education in France.” While France might emphasize the importance of adhering to the national culture rather than opposing immigration in itself, some European countries oppose increasing diversity as a whole.",
                "score": 0.28134683,
                "raw_content": null
            },
            {
                "title": "How the tide of migration is changing European politics - BBC",
                "url": "https://www.bbc.com/news/world-66202565",
                "content": "The Dutch government collapsed last week because the governing coalition could not agree on new restrictions on immigration, and the once uber-liberal Scandinavian countries have also adopted",
                "score": 0.18479727,
                "raw_content": null
            }
        ],
        "fact_check": {
            "misinformation_score": 0.6,
            "explanation": "The given text implies a direct correlation between immigration and increased divisions due to violent crimes, which is a simplification of a complex issue. While research indicates that immigration can influence nationalistic sentiments, attributing societal divisions solely to the actions of immigrants can perpetuate stereotypes and overlook broader socio-economic factors. Therefore, while there are elements of truth, the framing leans towards a narrative commonly associated with anti-immigration rhetoric, warranting a moderate misinformation score."
        }
    },
    {
        "id": "16",
        "content": "It is therefore crucial that Singapore manages its immigration inflow carefully: keeping it measured and balanced, paying close attention to relations and harmony between different ethnic groups, between new arrivals and people who are here, and taking in people who can fit in and add to Singapore’s society, SM Lee said.",
        "to_fact_check": false
    },
    {
        "id": "17",
        "content": "In Singapore, every new citizen goes through the Singapore Citizenship Journey on what it means to be Singaporean before getting citizenship.",
        "to_fact_check": false
    },
    {
        "id": "18",
        "content": "Integration and Naturalisation Champions from the People’s Association also run many programmes to welcome and integrate new citizens into their communities.",
        "to_fact_check": false
    },
    {
        "id": "19",
        "content": "SM Lee urged the new citizens to play their part by learning Singapore’s values and cultural norms, as well as getting involved and contributing actively to their communities.",
        "to_fact_check": false
    },
    {
        "id": "20",
        "content": "Other Singaporeans must play their part too by making friends with the new arrivals, and be big-hearted in welcoming them as valuable members of the Singapore team, he said.",
        "to_fact_check": false
    },
    {
        "id": "21",
        "content": "They should firmly reject those who play up nativist and xenophobic sentiments for political gain, which will do great harm to Singapore’s society, he added.",
        "to_fact_check": false
    },
    {
        "id": "22",
        "content": "The new citizens received their citizenship certificates from SM Lee, recited the National Pledge and sang the National Anthem to reinforce their commitment to Singapore and their shared identity as Singaporeans.",
        "to_fact_check": false
    },
    {
        "id": "23",
        "content": "Among the new citizens was Ms Prithikka Divyashini, 19, who moved to Singapore from Johor Bahru, Malaysia, about 12 years ago.",
        "to_fact_check": false
    },
    {
        "id": "24",
        "content": "The second-year chemical process technology student at ITE College East is the president of her school’s student ambassadors, and an active volunteer with local charity Meals on Wheels, distributing food to the elderly monthly.",
        "to_fact_check": false
    },
    {
        "id": "25",
        "content": "Her father is a Singaporean, and two of her three older siblings had received their Singapore citizenship before her. Her mother and sister are Singapore permanent residents (PRs).",
        "to_fact_check": false
    },
    {
        "id": "26",
        "content": "Senior Minister Lee Hsien Loong interacts with new citizens Pham The Hanh (left) and Pham Cao Hai Phong (centre).ST PHOTO: GIN TAY",
        "to_fact_check": false
    },
    {
        "id": "27",
        "content": "“I’m very grateful for this citizenship, and I feel really proud to be reciting the pledge as a Singaporean,” said the aspiring pharmacist. “I believe I will have more opportunities to excel as a citizen.”",
        "to_fact_check": false
    },
    {
        "id": "28",
        "content": "Dr Pham The Hanh, 46, came to Singapore from Hanoi, Vietnam, in 2003 on a Ministry of Education scholarship to do his PhD in electronics and computer engineering at the National University of Singapore.",
        "to_fact_check": false
    },
    {
        "id": "29",
        "content": "He stayed on as a researcher, and has been an engineering lecturer at Ngee Ann Polytechnic for over a decade. He has also been giving free tuition to primary and secondary school children at Teck Ghee Community Club once a week for more than five years.",
        "to_fact_check": false
    },
    {
        "id": "30",
        "content": "“It was easy for me to adapt to life here as I like the weather, food and people,” he said. “I will give back to Singapore by helping to educate young Singaporeans.”",
        "to_fact_check": false
    }
]